from math import sin, cos, sqrt
# 5.1. Записать по правилам изучаемого языка программирования 
# следующие выражения (все формулы должны вычисляться):

print("Задание 5.1")
print("--------------------------------")
x = 2
y = 4
a = 8
b = 6
n = -2
alpha = 5
betta = 3

result_1 = 2 * x
result_2 = sin(x)
result_3 = a ** 2
result_4 = sqrt(x)
result_5 = abs(n)
result_6 = 5 * cos(y)
result_7 = -7.5 * a ** 2
result_8 = 3 * sqrt(x)
result_9 = sin(alpha) * cos(betta) + cos(alpha) * sin(betta)
result_10 = 2 * sqrt(2 * b)
result_11 = 3 * sin(2 * alpha) * cos(3 * betta)
result_12 = -5 * sqrt(x + sqrt(y))

print(f'a) {result_1}\nб) {result_2}\nв) {result_3}\nг) {result_4}\nд) {result_5}\nе) {result_6}')
print(f'ж) {result_7}\nз) {result_8}\nи) {result_9}\nк) {result_10}\nл) {result_11}\nм) {result_12}')

print('=' * 40)

# 5.5. Составить программу: 
# а) вычисления значения функции  при любом значении а; 
# б) вычисления значения функции при любом значении х. 

print("Задание 5.5")
print("--------------------------------")

a = 4

x = sqrt((2 * a + sin(abs(3 * a)))/3.56)
print(f'x = {x}')

y = sin((3.2 + sqrt(1 + x))/abs(5 * x))
print(f'y = {y}')

print('=' * 40)

# 6.5. Напечатать числа следующим образом: 
# а) 21 19.2 
#     20 18.2 
#         ... 
#      10 8.2 
# б) 45 44.5 44.2 
#     44 43.5 43.2 
#             ... 
#      25 24.5 24.2 

print("Задание 6.5")
print("--------------------------------")

for num in range(21, 10-1, -1):
    print(num, num - 1.8)

for num in range(45, 25-1, -1):
    print(num, num - 0.5, num - 0.8)

print('=' * 40)

# 6.6. Напечатать числа следующим образом: 
# а) 21 20.4 
#     22 21.4 
#         ... 
#      35 34.4 
# б) 16 15.5 16.8 
#     17 16.5 17.8 
#             ... 
#     24 23.5 24.8 

print("Задание 6.6")
print("--------------------------------")

for num in range(21, 35+1):
    print(num, num - 0.6)

for num in range(16, 24+1):
    print(num, num - 0.5, num + 0.8)

print('=' * 40)

# 6.7. Одна штука некоторого товара стоит 20,4 руб. 
# Напечатать таблицу стоимости 2, 3, ..., 20 штук этого товара. 

print("Задание 6.7")
print("--------------------------------")
price_per_unit = 20.4
print(f"Цена за 1 шт.: {price_per_unit} руб.")
print("Кол-во  |  Стоимость  ")
print("--------|-------------")

for quantity in range(1, 20+1):
    total_cost = price_per_unit * quantity
    print(f"   {quantity:2d}   |  {total_cost} руб.")

print('=' * 40)

# 6.15. Рассчитать значения z для значений a, равных 2, 3, ..., 17: 

print("Задание 6.15")
print("--------------------------------")

for i in range(2,17+1):
    t  = 4 * i
    z = 3.5 * t**2 - 7 * t + 16
    print(f'При а = {i}: z = {int(z)}')

print('=' * 40)

# 6.17. Напечатать таблицу стоимости 50, 100, 150, ..., 1000 г сыра 
# (стоимость 1 кг сыра вводится с клавиатуры). 


print("Задание 6.17")
print("--------------------------------")

price = int(input('Введите стоимость 1кг сыра: '))

for i in range(50, 1000+1, 50):
    print(f'Стоимость {i}г сыра = {(i * price)/1000}')

print('=' * 40)

# 6.23. Найти: 
# а) сумму всех целых чисел от 100 до 500; 
# б) сумму всех целых чисел от a до 500 (значение a вводится с клавиатуры; a <= 500); 
# в) сумму всех целых чисел от –10 до b (значение b вводится с клавиатуры; b >= –10); 
# г) сумму всех целых чисел от a до b (значения a и b вводятся с клавиатуры; b >=  a).

print("Задание 6.23")
print("--------------------------------")

print('Вариант а)')
summ = 0
for _ in range(100,500+1):
    summ += _
print(f'Сумма всех целых чисел от 100 до 500 = {summ}')
print("--------------------------------")
print('Вариант б)')

try:
    a = int(input('Введите целое число <= 500: '))

except ValueError:
    print('Ошибка! Введите целое число.')
    exit()

if a > 500:
    print('Введено некорректное число!')
    exit()

summ = 0
for num in range(a, 500+1):
    summ += num

print(f'Сумма всех целых чисел от {a} до 500 = {summ}')

print("--------------------------------")
print('Вариант в)')

try:
    b = int(input('Введите целое число >= -10: '))

except ValueError:
    print('Ошибка! Введите целое число.')
    exit()

if b < -10:
    print('Введено некорректное число!')
    exit()

summ = 0
for num in range(-10, b+1):
    summ += num

print(f'Сумма всех целых чисел от -10 до {b} = {summ}')

print("--------------------------------")
print('Вариант г)')

try:
    a = int(input('Введите целое число a: '))
    b = int(input('Введите целое число b: '))

except ValueError:
    print('Ошибка! Введите целое число.')
    exit()

if b < a:
    print('Введено некорректное число!')
    exit()

summ = 0
for num in range(a, b+1):
    summ += num

print(f'Сумма всех целых чисел от {a} до {b} = {summ}')

print('=' * 40)

# 6.24. Найти: 
# а) произведение всех целых чисел от 8 до 15; 
# б) произведение всех целых чисел от a до 20 (значение a вводится с клавиатуры; 1 <= a <= 20); 
# в) произведение всех целых чисел от 1 до b (значение b вводится с клавиатуры; 1 <= b <= 20); 
# г) произведение всех целых чисел от a до b (значения a и b вводятся с клавиатуры; b >= a). 


print("Задание 6.24")
print("--------------------------------")

print('Вариант а)')

mult = 1
for _ in range(8,15+1):
    mult *= _
print(f'Произведение всех целых чисел от 8 до 15 = {mult}')

print("--------------------------------")
print('Вариант б)')

try:
    a = int(input('Введите целое число от 1 до 20: '))

except ValueError:
    print('Ошибка! Введите целое число.')
    exit()

if a < 1 or a > 20:
    print('Введено некорректное число!')
    exit()

mult = 1
for num in range(a, 20+1):
    mult *= num

print(f'Произведение всех целых чисел от {a} до 20 = {mult}')

print("--------------------------------")
print('Вариант в)')

try:
    b = int(input('Введите целое число от 1 до 20: '))

except ValueError:
    print('Ошибка! Введите целое число.')
    exit()

if b < 1 or b > 20:
    print('Введено некорректное число!')
    exit()

mult = 1
for num in range(1, b+1):
    mult *= num

print(f'Произведение всех целых чисел от 1 до {b} = {mult}')

print("--------------------------------")
print('Вариант г)')

try:
    a = int(input('Введите целое число a: '))
    b = int(input('Введите целое число b: '))

except ValueError:
    print('Ошибка! Введите целое число.')
    exit()

if b < a:
    print('Введено некорректное число!')
    exit()

mult = 1
for num in range(a, b+1):
    mult *= num

print(f'Произведение всех целых чисел от {a} до {b} = {mult}')

print('=' * 40)

# 6.28. Вычислить сумму

print("Задание 6.28")
print("--------------------------------")
n = 8
summ = 0
for i in range(1, n+1):
    num = 1 / i
    summ += num

print(f'Сумма = {summ}')
print('=' * 40)


# 6.29 Вычислить сумму 

print("Задание 6.29")
print("--------------------------------")

total = 0
for i in range(2,10+1):
    total += i / (i + 1)

print(f'Сумма = {total}')
print('=' * 40)

# 6.35. Даны числа a1, a2, an , , ..., . Определить их сумму. 

print("Задание 6.29")
print("--------------------------------")

a = 3
n  = int(input('Введите целое число > 2: '))
summ = 0

for i in range(1,n+1):
    mult = a * i
    summ += mult
print(f'Сумма = {summ}')
print('=' * 40)

# 6.36. Даны натуральное число n и вещественные числа a1,a2, .., an.
# Определить сумму всех вещественных чисел. 

print("Задание 6.36")
print("--------------------------------")

try:
    n = int(input('Введите натуральное число n: '))
    if n <= 0:
        print('Ошибка! Число должно быть натуральным (n > 0).')
        exit()
        
except ValueError:
    print('Ошибка! Введите целое число.')
    exit()

summ = 0.0

for i in range(1, n + 1):
    a = float(input(f'Введите вещественное число a{i}: '))
    summ += a

print(f'Сумма всех вещественных чисел = {summ}')
print('=' * 40)


# 6.37. Известна масса каждого из 12 предметов. 
# Определить общую массу всего набора предметов.
 

print("Задание 6.37")
print("--------------------------------")
sum_w = 0
for i in range(1,12+1):
    weight = int(input(f'Введите массу {i} предмета: '))
    sum_w += weight

print(f'Сумма = {sum_w}')
print('=' * 40)

# 6.42. Даны числа a1,a2,...,a6. Определить их произведение. 

print("Задание 6.42")
print("--------------------------------")

mult = 1
for i in range(1,6+1):
    a = int(input(f'Введите число а{i}: '))
    mult *= a

print(f'Произведение всех чисел = {mult}')
print('=' * 40)

# 6.43. Даны числа a1,a2,...,a10. Определить сумму их квадратов. 

print("Задание 6.43")
print("--------------------------------")
summ = 0
for i in range(1,10+1):
    a = int(input(f'Введите число а{i}: '))
    summ += a**2

print(f'Сумма квадратов всех чисел = {summ}')
print('=' * 40)

# 6.44. Даны натуральное число n и вещественные числа a1,a2,..,an. 
# Определить сумму квадратов вещественных чисел. 

print("Задание 6.44")
print("--------------------------------")

try:
    n = int(input('Введите натуральное число n: '))
    if n <= 0:
        print('Ошибка! Число должно быть натуральным (n > 0).')
        exit()
        
except ValueError:
    print('Ошибка! Введите целое число.')
    exit()

summ = 0.0

for i in range(1, n + 1):
    a = float(input(f'Введите вещественное число a{i}: '))
    summ += a**2

print(f'Сумма всех вещественных чисел = {summ}')
print('=' * 40)

# 6.45. Даны числа a1,a2,...,a10. 
# Определить их среднее арифметическое.

print("Задание 6.45")
print("--------------------------------")

average_sum = 0
for i in range(1,10+1):
    a = int(input('Введите число: '))
    average_sum += a

print(f'Среднее арифметическое = {average_sum/10}')